README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-22 Wed 18:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Unrival</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="David Joseph" />
<link rel="stylesheet" type="text/css" href="http://www.star.bris.ac.uk/bjm/css/bjm.css" />
</head>
<body>
<div id="content">
<h1 class="title">Unrival
<br />
<span class="subtitle">A Protocol for Decentralized Integrity Accounting </span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org394f36b">Introduction</a></li>
</ul>
</div>
</div>

<div id="outline-container-org394f36b" class="outline-2">
<h2 id="org394f36b">Introduction</h2>
<div class="outline-text-2" id="text-org394f36b">
<p>
Unrival is a protocol for tracking the credibility of objects within a network, as defined by these objects on their own terms.  There is no top-down notion of credibility; instead, agents attach claims to objects to let other agents know what can be expected of them.  These claims are then assessed based on whether outcomes match expectations (which correlate strongly with claims).  Over time, the public record of claims and corresponding assessments creates a skin in the game mechanism for agents, whose good faith participation in the network is thus incentivized.
</p>

<p>
To illustrate, consider a news article posted on the web.  News is supposed to be factual, relevant, and balanced, but these claims are mere implicit ideals; there's no way to hold a publication's feet to the fire when it misses the mark (and indeed, for many publications, this is a feature and not a bug).  When these ideals are made explicit via claims, however, accountability is possible.  Claims attached to objects in an Unrival network represent credibility that's been staked by stakeholders.  This is a signal to consuming agents that an object's quality has been vouched for.  In this way, the criteria for promoting content are transparent and can serve attract consumption by overtly aligning with the interests of the consumers, rather than through exploitation.
</p>

<p>
Not only are claims subject to assessment, but assessments are as well.  For example, if an agent leaves an unfair assessment for a certain product &#x2013; perhaps with an attached message indicating that this assessment is politically motivated &#x2013; then another agent is behooved to evaluate it as such, since their counter-assessment is more likely to be corroborated than the original assessment.  The justification for the counter-assessment would not be the political motivation of the original assessment, but rather its failure to faithfully assess the product <i>on its own terms</i> - i.e. according to what the creator or proponents of the object claim about it.  
</p>

<p>
Notions of credibility can differ significantly.  A particular notion of credibility is represented by an object called a context, which can be thought of as a type of micro-worldview.  
</p>

<p>
A context includes:
</p>

<ul class="org-ul">
<li><b>interpretations</b>: whereby objects are interpreted, i.e. values are assigned to the words that describe these objects</li>
<li><b>delegates</b>: agents who vote on updates to a context.  Updates include assigning new delegates and updating intepretations</li>
<li><b>ledgers</b>: records of claims and assessments made by agents and the amount of credit staked on them</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Joseph</p>
<p class="date">Created: 2021-09-22 Wed 18:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
